app/controllers/autors_controller.rb

SELECT * FROM `autors` WHERE (nombre like '5%') ORDER BY id ASC LIMIT 0, 7
SELECT count(*) AS count_all FROM `autors`
---
  def index

    @qbe_key = Autor.new() #Con esto, solo veremos los argumentos propios a la clase...
    #En base al qbe_key construido en la vista, se construye el qbe_select para el select...
    build_qbe(params)  #TODO: Mejorar uso parámetors... que no sean "cableados"...

    if  not @qbe_select.nil?
      @autors = Autor.paginate :page => params[:page],  :order => 'id ASC', :conditions =>  @qbe_select

SELECT * FROM `autors` WHERE (`autors`.`id` = 1)
SELECT * FROM "titulos" WHERE ( autor_id = 1) ORDER BY id ASC LIMIT 7 OFFSET 0
SELECT count(*) AS count_all FROM `titulos` WHERE ( autor_id = 1)
---
  def show
    @autor = Autor.find(params[:id])
    @titulos = Titulo.paginate :page => params[:page], :order => 'id ASC',
                               :conditions => " autor_id = " + params[:id]

SELECT * FROM `autors` WHERE (`autors`.`id` = 1)
---
  def edit
    @autor = Autor.find(params[:id])

INSERT INTO `autors` (`fecha`, `updated_at`, `nombre`, `created_at`) VALUES('2010-04-28', '2010-04-29 02:07:28', 'Luis Capriles', '2010-04-29 02:07:28')
---
  def create
    @autor = Autor.new(params[:autor])

    respond_to do |format|
      if @autor.save

SELECT * FROM `autors` WHERE (`autors`.`id` = 3)
UPDATE `autors` SET `nombre` = 'Pedro Perez Dos', `updated_at` = '2010-04-29 22:19:40' WHERE `id` = 3
---
  def update
    @autor = Autor.find(params[:id])

    respond_to do |format|
      if @autor.update_attributes(params[:autor])

SELECT * FROM "autors" WHERE (nombre like 'Luis capriles%')
---
  def auto_complete_for_autor_nombre
    @autors = Autor.find(:all, :conditions => "nombre like " + "'" + params[:autor][:nombre] + "%'" )

SELECT * FROM `autors` ORDER BY id ASC LIMIT 0, 7
SELECT count(*) AS count_all FROM `autors`
---
  def index_select #Presentamos la ventana Index modal...
    @qbe_key = Autor.new()
    @autors = Autor.paginate :page => params[:page],  :order => 'id ASC'

SELECT * FROM `autors` ORDER BY id ASC LIMIT 0, 7
SELECT count(*) AS count_all FROM `autors`
---
  def index_select1  #Actualizamos el grid de la ventana Index modal...
    @qbe_key = Autor.new()
    build_qbe(params)  #TODO: Mejorar uso parámetors... que no sean "cableados"...
    session[:pagina] = session[:pagina] + params[:page].to_i    #TODO: CRITICO - Manejo Nro.Pg negativos
    if  not @qbe_select.nil?
      @autors = Autor.paginate :page => params[:page],  :order => 'id ASC', :conditions =>  @qbe_select