app/controllers/titulos_controller.rb

  def index

    @qbe_index = Titulo.new(params[:titulo])

    params.each do |key, value|
      if @qbe_index.attribute_names().include?(key)
         if not value.blank?
          if @select_buff_index.nil?
            @select_buff_index =  key + " like " + "'" + value + "%'"
            @qbe_index[key] = value
          else
            @select_buff_index = @select_buff_index + " and " + key + " like " + "'" + value + "%'"
            @qbe_index[key] = value
          end
        end
      end
    end

    if  not @select_buff_index.nil?
      @titulos = Titulo.paginate :page => params[:page],  :order => 'id ASC', :conditions =>  @select_buff_index
---
SELECT * FROM `titulos` ORDER BY id ASC LIMIT 0, 7
SELECT count(*) AS count_all FROM `titulos`

  def show
    @titulo = Titulo.find(params[:id])
---
SELECT * FROM `titulos` WHERE (`titulos`.`id` = 1)

  def edit
    @titulo = Titulo.find(params[:id])
---
SELECT * FROM `titulos` WHERE (`titulos`.`id` = 1)

  def create
    @titulo = Titulo.new(params[:titulo])

    respond_to do |format|
      if @titulo.save
---
INSERT INTO "titulos" ("fecha", "autor_id", "updated_at", "nombre", "created_at") VALUES('2010-05-20', 1, '2010-05-13 22:49:07', 'Primer Titulo', '2010-05-13 22:49:07')

  def update
    @titulo = Titulo.find(params[:id])

    respond_to do |format|
      if @titulo.update_attributes(params[:titulo])
---
SELECT * FROM `titulos` WHERE (`titulos`.`id` = 1)
UPDATE `titulos` SET `nombre` = 'Libro 1 Corregido', `updated_at` = '2010-04-29 22:22:31' WHERE `id` = 1

  def destroy
    @titulo = Titulo.find(params[:id])
    @titulo.destroy
---
SELECT * FROM `titulos` WHERE (`titulos`.`id` = 2)
DELETE FROM `titulos` WHERE `id` = 2